# (실습) 데이터프레임 인덱싱

**필수 라이브러리**

In [1]:
import numpy as np
import pandas as pd

## 인덱싱/슬라이싱

**열 라벨 인덱싱**

시리즈가 생성된다.

In [35]:
df["A"]

2013-01-01    1.764052
2013-01-02    1.867558
2013-01-03   -0.103219
2013-01-04    0.761038
2013-01-05    1.494079
2013-01-06   -2.552990
Freq: D, Name: A, dtype: float64

열 라벨을 객체의 속성처럼 이용하는 방식도 가능하다. 
단, 열 라벨의 이름이 공백을 포함하지 않아야 한다.

In [18]:
df.A

2013-01-01    1.764052
2013-01-02    1.867558
2013-01-03   -0.103219
2013-01-04    0.761038
2013-01-05    1.494079
2013-01-06   -2.552990
Freq: D, Name: A, dtype: float64

**행 슬라이싱**

위치 인덱스를 활용하여 행 슬라이싱을 진행하면 데이터프레임이 생성된다.

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-03 -0.103219  0.410599  0.144044  1.454274

인덱스 라벨을 활용하여 슬라이싱을 진행할 수도 있다. 
위치 인덱스 방식과는 달리 구간의 마지막 라벨로 포함된다.

In [20]:
df["20130101":"20130103"]

                   A         B         C         D
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-03 -0.103219  0.410599  0.144044  1.454274

:::{admonition} 라벨 슬라이싱의 구간
:class: note

라벨을 이용한 슬라이싱은 구간의 양끝을 모두 포함한다.
:::

**`loc[]` 객체 활용: 라벨 인덱싱/슬라이싱**

인덱싱 또는 슬라이이싱을 이용하여 데이터프레임의 행과 열의 일부를 다른 값으로 대체하려면
`loc[]` 객체 또는 `iloc[]` 개체를 이용한다.

- `loc[]` 객체: 행 라벨과 열 라벨 활용
- `iloc[]` 객체: 행과 열의 정수 인덱스 활용

`df`의 인덱스는 `dates` 변수가 가리키는 날짜 인덱스를 사용한다.

In [38]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [39]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

첫째 날짜의 데이터는 다음과 같다.

In [40]:
df.loc[dates[0]]

A    1.764052
B    0.400157
C    0.978738
D    2.240893
Name: 2013-01-01 00:00:00, dtype: float64

**축 활용**

행과 열에 대한 인덱싱/슬라이싱 동시에 지정하려면 축을 활용한다.

- `A`, `B` 두 열만 추출.

In [41]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.764052  0.400157
2013-01-02  1.867558 -0.977278
2013-01-03 -0.103219  0.410599
2013-01-04  0.761038  0.121675
2013-01-05  1.494079 -0.205158
2013-01-06 -2.552990  0.653619

- 특정 행만 대상으로 `A`, `B` 두 열 추출

In [42]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  1.867558 -0.977278
2013-01-03 -0.103219  0.410599
2013-01-04  0.761038  0.121675

인덱싱이 사용될 때마다 차원이 줄어든다.

In [43]:
df.loc["20130102", ["A", "B"]]

A    1.867558
B   -0.977278
Name: 2013-01-02 00:00:00, dtype: float64

두 개의 인덱싱은 결국 하나의 스칼라가 생성된다.

In [44]:
df.loc[dates[0], "A"]

1.764052345967664

**`iloc[]` 객체 활용: 위치 인덱싱/슬라이싱**

행의 위치 인덱스를 이용한다.

In [45]:
df.iloc[3]

A    0.761038
B    0.121675
C    0.443863
D    0.333674
Name: 2013-01-04 00:00:00, dtype: float64

넘파이 어레이 인덱싱/슬라이싱 방식이 그대로 지원된다.

In [46]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.761038  0.121675
2013-01-05  1.494079 -0.205158

**팬시 인덱잉**

넘파이 어레이의 팬시 인덱싱과는 다르게 작동한다.

In [47]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.867558  0.950088
2013-01-03 -0.103219  0.144044
2013-01-05  1.494079  0.313068

In [48]:
df.iloc[[1, 2, 4], [0, 2, 3]]

                   A         C         D
2013-01-02  1.867558  0.950088 -0.151357
2013-01-03 -0.103219  0.144044  1.454274
2013-01-05  1.494079  0.313068 -0.854096

In [49]:
df.iloc[[1, 2, 4], [0, 2, 3, 1]]

                   A         C         D         B
2013-01-02  1.867558  0.950088 -0.151357 -0.977278
2013-01-03 -0.103219  0.144044  1.454274  0.410599
2013-01-05  1.494079  0.313068 -0.854096 -0.205158

**행 슬라이싱**

In [50]:
df.iloc[1::2, :]

                   A         B         C         D
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-06 -2.552990  0.653619  0.864436 -0.742165

1번 축은 무시해도 된다.

In [51]:
df.iloc[1::2]

                   A         B         C         D
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-06 -2.552990  0.653619  0.864436 -0.742165

**열 슬라이싱**

0번 축을 반드시 명시해야 한다.

In [53]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.400157  0.978738
2013-01-02 -0.977278  0.950088
2013-01-03  0.410599  0.144044
2013-01-04  0.121675  0.443863
2013-01-05 -0.205158  0.313068
2013-01-06  0.653619  0.864436

### 리인덱싱

리인덱싱<font size='2'>reindexing</font>은
이미 생성된 시리즈와 데이터프레임의 열 라벨 또는 행 라벨을 
선택하여 새로운 시리즈 또는 데이터프레임을 생성하는 기법이다.
행과 열의 라벨은 지정된 순서에 정해지며,
기존에 사용되지 않은 라벨이 추가되는 경우 해당 행 또는 열의 항목은 결측치로 처리된다.

**시리즈 리인덱싱**

먼저 하나의 새로운 시리즈를 생성한다.

In [55]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a    1.469359
b    0.154947
c    0.378163
d   -0.887786
e   -1.980796
dtype: float64

원하는 행을 원하는 순서대로 갖는 시리즈를 생성한다.
기존에 없는 행 라벨을 사용하면 결측치로 처리된다.

In [56]:
s.reindex(["e", "b", "f", "d"])

e   -1.980796
b    0.154947
f         NaN
d   -0.887786
dtype: float64

**데이터프레임 리인덱싱**

`df` 데이터프레임을 계속 이용한다.

In [58]:
df

                   A         B         C         D
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-03 -0.103219  0.410599  0.144044  1.454274
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-05  1.494079 -0.205158  0.313068 -0.854096
2013-01-06 -2.552990  0.653619  0.864436 -0.742165

행 인덱스는 `dates`가 가리키고 있다.

In [59]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

행과 열의 라벨을 원하는 대로 지정한다.

In [60]:
df.reindex(index=[dates[1], dates[3], dates[0]], columns=["C", "B", "A"])

                   C         B         A
2013-01-02  0.950088 -0.977278  1.867558
2013-01-04  0.443863  0.121675  0.761038
2013-01-01  0.978738  0.400157  1.764052

행 또는 열 라벨 한나만 이용할 경우 축을 지정해야 한다.

In [61]:
df.reindex([dates[1], dates[3], dates[0]], axis="index")

                   A         B         C         D
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-01  1.764052  0.400157  0.978738  2.240893

In [62]:
df.reindex(["C", "B", "A"], axis="columns")

                   C         B         A
2013-01-01  0.978738  0.400157  1.764052
2013-01-02  0.950088 -0.977278  1.867558
2013-01-03  0.144044  0.410599 -0.103219
2013-01-04  0.443863  0.121675  0.761038
2013-01-05  0.313068 -0.205158  1.494079
2013-01-06  0.864436  0.653619 -2.552990

0 또는 1을 이용하여 축을 지정해도 된다.

In [63]:
df.reindex([dates[1], dates[3], dates[0]], axis=0)

                   A         B         C         D
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-01  1.764052  0.400157  0.978738  2.240893

In [64]:
df.reindex(["C", "B", "A"], axis=1)

                   C         B         A
2013-01-01  0.978738  0.400157  1.764052
2013-01-02  0.950088 -0.977278  1.867558
2013-01-03  0.144044  0.410599 -0.103219
2013-01-04  0.443863  0.121675  0.761038
2013-01-05  0.313068 -0.205158  1.494079
2013-01-06  0.864436  0.653619 -2.552990

### 부울 인덱싱

넘파이 어레이의 부울 인덱싱에 사용된 부울 마스크를 거의 유사하게 활용한다.

**행 선택 부울 인덱싱**

예를 들어 `A` 열에 양수 항목이 있는 행만 추출하려면 아래 부울 마스크를 이용한다.

In [65]:
mask = df["A"] > 0
mask

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [67]:
df.loc[mask]

                   A         B         C         D
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-05  1.494079 -0.205158  0.313068 -0.854096

**항목 전체 대상 인덱싱**

예를 들어 양수 항목만 그대로 두고 나머지는 모두 결측치로 처리하려면 아래 부울 마스크를 이용한다.

In [68]:
mask = df > 0

In [69]:
df[mask]

                   A         B         C         D
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558       NaN  0.950088       NaN
2013-01-03       NaN  0.410599  0.144044  1.454274
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-05  1.494079       NaN  0.313068       NaN
2013-01-06       NaN  0.653619  0.864436       NaN

**주의사항**

넘파이 어레이 방식과 다르게 작동한다.

In [73]:
aArray = df.to_numpy()
aArray

array([[ 1.76405235,  0.40015721,  0.97873798,  2.2408932 ],
       [ 1.86755799, -0.97727788,  0.95008842, -0.15135721],
       [-0.10321885,  0.4105985 ,  0.14404357,  1.45427351],
       [ 0.76103773,  0.12167502,  0.44386323,  0.33367433],
       [ 1.49407907, -0.20515826,  0.3130677 , -0.85409574],
       [-2.55298982,  0.6536186 ,  0.8644362 , -0.74216502]])

In [74]:
aMask = aArray > 0
aMask

array([[ True,  True,  True,  True],
       [ True, False,  True, False],
       [False,  True,  True,  True],
       [ True,  True,  True,  True],
       [ True, False,  True, False],
       [False,  True,  True, False]])

아래 코드에서처럼 양수 항목만 모은 1차원 어레이가 생성된다.

In [75]:
aArray[aMask]

array([1.76405235, 0.40015721, 0.97873798, 2.2408932 , 1.86755799,
       0.95008842, 0.4105985 , 0.14404357, 1.45427351, 0.76103773,
       0.12167502, 0.44386323, 0.33367433, 1.49407907, 0.3130677 ,
       0.6536186 , 0.8644362 ])

## 데이터프레임 수정

인덱싱/슬라이싱을 이용하여 항목 변경, 행/열 추가 등을 실행한다.

**열 추가**

아래 시리즈를 `df`의 새로운 열로 추가하려 한다.

In [76]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

열 라벨은 `F`로 지정한다.
그러면 `2013-01-01`의 데이터가 없기에 결측치로 처리된다.

In [78]:
df.loc[:, "F"] = s1
df

                   A         B         C         D    F
2013-01-01  1.764052  0.400157  0.978738  2.240893  NaN
2013-01-02  1.867558 -0.977278  0.950088 -0.151357  1.0
2013-01-03 -0.103219  0.410599  0.144044  1.454274  2.0
2013-01-04  0.761038  0.121675  0.443863  0.333674  3.0
2013-01-05  1.494079 -0.205158  0.313068 -0.854096  4.0
2013-01-06 -2.552990  0.653619  0.864436 -0.742165  5.0

**항목 지정**

아래 코드는 `2013-01-01` 행의 `'A'`열의 값을 0으로 지정한다.

In [80]:
df.loc[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.400157  0.978738  2.240893  NaN
2013-01-02  1.867558 -0.977278  0.950088 -0.151357  1.0
2013-01-03 -0.103219  0.410599  0.144044  1.454274  2.0
2013-01-04  0.761038  0.121675  0.443863  0.333674  3.0
2013-01-05  1.494079 -0.205158  0.313068 -0.854096  4.0
2013-01-06 -2.552990  0.653619  0.864436 -0.742165  5.0

`iloc[]`도 활용할 수 있다.
아래 코드는 `2013-01-01` 행의 `'B'`열의 값도 0으로 지정한다.

In [91]:
df.iloc[0, 1] = 0
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0
2013-01-03 -0.103219  0.410599  0.144044  5.0  2.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0
2013-01-05  1.494079 -0.205158  0.313068  5.0  4.0
2013-01-06 -2.552990  0.653619  0.864436  5.0  5.0

**행/열 지정**

어레이를 이용하여 열 또는 행을 지정할 수 있다.
아래 코드는 `D` 열을 새로운 어레이로 지정한다.

In [89]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN
2013-01-02  3.000000  3.000000  3.000000  5.0  3.0
2013-01-03 -0.103219  0.410599  0.144044  5.0  2.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0
2013-01-05  1.494079 -0.205158  0.313068  5.0  4.0
2013-01-06 -2.552990  0.653619  0.864436  5.0  5.0

아래 코드는 `2013-01-02` 행을 새롭게 지정한다.

In [90]:
df.loc[dates[1], :] = np.array([3] * df.shape[1])
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0
2013-01-03 -0.103219  0.410599  0.144044  5.0  2.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0
2013-01-05  1.494079 -0.205158  0.313068  5.0  4.0
2013-01-06 -2.552990  0.653619  0.864436  5.0  5.0

`iloc[]` 객체를 이용할 수도 있다.
아래 코드는 2번 행을 새로 지정한다.

In [94]:
df.iloc[2, :] = np.array([4] * df.shape[1])
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0
2013-01-05  1.494079 -0.205158  0.313068  5.0  4.0
2013-01-06 -2.552990  0.653619  0.864436  5.0  5.0

## 결측치 처리

모든 결측치는 내부적으로 `np.nan`로 처리된다. 
다만 자료형에 따라 `NaN`(부동소수점), `NA`(정수), `NaT`(시간) 등으로 표기된다.
결측치를 처리하는 연습을 위해 `df`를 수정하여 결측치를 일부 포함한 데이터프레임을 생성한다.

In [105]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0
2013-01-05  1.494079 -0.205158  0.313068  5.0  4.0
2013-01-06 -2.552990  0.653619  0.864436  5.0  5.0

리인덱싱으로 다음 데이터프레임을 생성한다.
`'E'`열이 추가되는데 `df`에 없던 열이기에 모든 항목이 결측치로 지정된다.

In [106]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN NaN
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0 NaN
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0 NaN
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0 NaN

결측치 일부도 특정 값으로 채운다.
아래 코드는 `'E'`열의 일부를 1로 지정한다.

In [107]:
df1.loc[dates[0] : dates[1], 'E'] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  NaN
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  NaN

**`isna()` 함수**

결측치가 위치한 곳만 `True` 항목을 갖는 부울 마스크를 생성한다.

In [110]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

데이터프레임의 `isna()` 메서드가 동일한 일을 수행한다.

In [111]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

**`dropna()` 메서드**

결측치를 포함한 행 또는 열이 삭제된 데이터프레임을 반환한다.

- 행 기준: `axis=0`이 기본값임. 아래 코드는 결측치를 하나 이상 포함한 모든 행 삭제.

In [112]:
df1.dropna(how='any')

              A    B    C    D    F    E
2013-01-02  3.0  3.0  3.0  3.0  3.0  1.0

- 행 기준: `axis=0`이 기본값임. 아래 코드는 결측치로만 구성된 모든 행 삭제.

In [117]:
df1.dropna(how='all')

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  NaN
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  NaN

- 열 기준: `axis=1` 지정. 아래 코드는 하나 이상의 결측치를 포함한 모든 열 삭제.

In [118]:
df1.dropna(axis=1, how='any')

                   A         B         C    D
2013-01-01  0.000000  0.000000  0.978738  5.0
2013-01-02  3.000000  3.000000  3.000000  3.0
2013-01-03  4.000000  4.000000  4.000000  4.0
2013-01-04  0.761038  0.121675  0.443863  5.0

- 열 기준: `axis=1` 지정. 아래 코드는 하나 결측치로만 구성된 모든 열 삭제.

In [119]:
df1.dropna(axis=1, how='all')

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  NaN
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  NaN

**`fillna()` 메서드**

모든 결측치를 지정된 값으로 채운 데이터프레임을 생성한다.

In [120]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  5.0  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  5.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  5.0

**`ffill()` 메서드**

열 별로 모든 결측치를 위쪽에 위치한 가장 가까운 값으로 채운 데이터프레임을 생성한다.

In [127]:
df1.ffill()

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  NaN  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  1.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  1.0

`axis=1`을 지정하면 행 기준으로 채워진다.

In [128]:
df1.ffill(axis=1)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  5.0  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  4.0
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  3.0

**`bfill()` 메서드**

열 별로 모든 결측치를 아래쪽에 위치한 가장 가까운 값으로 채운 데이터프레임을 생성한다.

In [125]:
df1.bfill()

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  3.0  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  NaN
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  NaN

`axis=1`을 지정하면 행 기준으로 채워진다.

In [126]:
df1.bfill(axis=1)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.978738  5.0  1.0  1.0
2013-01-02  3.000000  3.000000  3.000000  3.0  3.0  1.0
2013-01-03  4.000000  4.000000  4.000000  4.0  4.0  NaN
2013-01-04  0.761038  0.121675  0.443863  5.0  3.0  NaN